perftests/smol-run1.log
hey -z 30s -m GET -cpus 4 -c 200 http://localhost:9000/smol-perf

Summary:
  Total:	30.0137 secs
  Slowest:	0.1409 secs
  Fastest:	0.0000 secs
  Average:	0.0136 secs
  Requests/sec:	14754.3833
  
  Total data:	16824994 bytes
  Size/request:	38 bytes

Response time histogram:
  0.000 [1]	|
  0.014 [262119]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.028 [147309]	|■■■■■■■■■■■■■■■■■■■■■■
  0.042 [25370]	|■■■■
  0.056 [6067]	|■
  0.070 [1332]	|
  0.085 [362]	|
  0.099 [107]	|
  0.113 [60]	|
  0.127 [30]	|
  0.141 [6]	|


Latency distribution:
  10% in 0.0018 secs
  25% in 0.0062 secs
  50% in 0.0123 secs
  75% in 0.0185 secs
  90% in 0.0255 secs
  95% in 0.0323 secs
  99% in 0.0478 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.1409 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0025 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0396 secs
  resp wait:	0.0134 secs, 0.0000 secs, 0.1409 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0428 secs

Status code distribution:
  [200]	442763 responses

Error distribution:
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63963->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63964->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63965->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63966->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63967->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63968->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63969->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63970->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63971->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63972->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63973->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63974->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63975->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63976->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63977->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63978->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63979->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63980->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63981->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63982->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63983->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63984->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63985->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63986->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63987->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63988->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63989->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63990->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63991->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63992->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63993->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63994->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63995->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63996->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63997->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63998->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:63999->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64000->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64001->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64002->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64003->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64004->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64005->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64006->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64007->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64008->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64009->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64010->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64011->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64012->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64013->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64014->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64015->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64016->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64017->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64018->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64019->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64020->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64021->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64022->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64023->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64024->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64025->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64026->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64027->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64028->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64029->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64030->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64031->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64032->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:64033->[::1]:9000: read: connection reset by peer